from app import app
from models import School
from database import db

# قائمة المدارس المطلوب إضافتها (مدارس الذكور فقط)
schools_to_add = [
    "بيرين الثانوية للبنين",
    "العالوك الثانوية للبنين",
    "صروت الثانوية للبنين",
    "الكمشة الثانوية للبنين",
    "ام المكمان الجنوبي الثانوية للبنين",
    "مرحب الثانوية الاولى للبنين",
    "مرحب الأساسية الثانية للبنين",
    "الناصرية الثانوية للبنين",
    "الميدان الثانوية للبنين",
    "ام رمانة الثانوية للبنين",
    "الظليل الثانوية للبنين",
    "عكرمة الثانوية للبنين",
    "المقريزي الاساسية للبنين",
    "العباس بن عبد المطلب الأساسية للبنين",
    "الاستقلال الأساسية للبنين",
    "نور الدين زنكي الأساسية للبنين",
    "ابو عبيدة الاساسية للبنين",
    "الشخوت الثانوية للبنين",
    "ابو ايوب الانصاري الأساسية الثانية للبنين",
    "المشيدة الأساسية الاولى للبنين",
    "السخنة الثانوية اللبنين",
    "السخنه الاساسيه للبنين",
    "حي الصالحية الأساسية الثانية للبنين",
    "القنية الثانوية الاولى للبنين",
    "دوقرة الثانوية للبنين",
    "ابو الزيغان الثانوية للبنين",
    "الشهيد راشد الزيود الثانوية للبنين",
    "الشهيد راشد الزيود الأساسية للبنين",
    "الشهيد احمد الزيود الثانوية للبنين",
    "عمر بن الخطاب الاساسية للبنين",
    "ابن الانباري الأساسية للبنين",
    "الشهيد لؤي الزيود الثانوية للبنين",
    "غريسا الاساسية للبنين",
    "الفيحاء الاساسية للبنين",
    "قصر الحلابات الشرقي الثانوية للبنين",
    "زيد بن حارثة الأساسية للبنين",
    "قصر الحلابات الغربي الثانوية للبنين",
    "طارق بن زياد الاساسية للبنين",
    "علي بن الحسين الثانوية للبنين",
    "ابن سينا الاساسية للبنين",
    "الازرق الثانوية للبنين"
]

# استبعاد المدارس المختلطة
mixed_schools = [
    "ناصرية المشاقبه الاساسيه المختلطه",
    "الحصب الاساسية المختلطة",
    "معهد تدريب مهني الهاشمية",
    "المعهد الأردني الكوري للتكنولوجيا",
    "حي ضبعان الاساسية المختلطة",
    "لبابة بنت الحارث الاساسية المختلطة"
]

def add_schools():
    with app.app_context():
        # إضافة كل مدرسة إلى قاعدة البيانات
        for school_name in schools_to_add:
            # التحقق من عدم وجود المدرسة مسبقًا
            existing_school = School.query.filter_by(name=school_name).first()
            
            # تخطي المدارس المختلطة
            if any(mixed_school in school_name for mixed_school in mixed_schools):
                print(f"تم تخطي المدرسة المختلطة: {school_name}")
                continue
                
            if not existing_school:
                school = School(name=school_name, gender="ذكور")
                db.session.add(school)
                print(f"تمت إضافة مدرسة: {school_name}")
            else:
                # تحديث جنس المدرسة إذا كانت موجودة بالفعل
                existing_school.gender = "ذكور"
                print(f"تم تحديث جنس المدرسة: {school_name}")
        
        # حفظ التغييرات
        db.session.commit()
        print("تم الانتهاء من إضافة المدارس")

if __name__ == "__main__":
    add_schools()