# قائمة الوظائف المتاحة
JOB_TITLES = [
    "مدير المدرسة",
    "مساعد مدير المدرسة",
    "امين لوازم مدرسية",
    "امين مكتبة",
    "مرشد تربوي",
    "قيم مختبر حاسوب",
    "قيم مختبر علوم",
    "معلم",
    "معلم مصادر",
    "معلم مهندس",
    "محاسب"
]

# قائمة الوظائف لموظفي المديرية
DIRECTORATE_JOB_TITLES = [
    "مدير تربية وتعليم",
    "مدير شؤون ادارية ومالية",
    "مدير شؤون تعليمية وفنية",
    "رئيس قسم",
    "فني صيانه",
    "مهندس",
    "كاتب",
    "اداري",
    "محاسب مساعد",
    "معلم",
    "فني اجهزه",
    "امين مكتبه",
    "مبرمج مساعد",
    "مهندس حاسوب",
    "رئيس قسم/مكلف",
    "امين صندوق",
    "محاسب",
    "عضو قسم",
    "مساعد مدير مدرسه",
    "مأمور تصوير",
    "حارس",
    "مراسل",
    "مأمور مقسم",
    "محرر صحفي",
    "سائق",
    "امين عهده",
    "امين لوازم",
    "مأمور حركه",
    "امين سجل",
    "امين مستودع",
    "فني حاسوب مدرسة",
    "امين لوازم مدرسه",
    "كاتب مدرسه",
    "رئيس قسم /مكلف",
    "مدقق داخلي",
    "رئيس قسم الاشراف",
    "مشرف تربوي",
    "كاتب اشراف",
    "مرشد تربوي"
]

# قائمة الأقسام لموظفي المديرية
DIRECTORATE_DEPARTMENTS = [
    "مدير تربية وتعليم",
    "مدير شؤون ادارية ومالية",
    "مدير شؤون تعليمية وفنية",
    "الابنية",
    "التخطيط التربوي",
    "تكنولوجيا التعليم والمعلومات",
    "التدقيق المالي",
    "الشؤون الماليه",
    "الارشاد التربوي",
    "النشاطات التربوية",
    "الديوان",
    "الاعلام",
    "الامتحانات والاختبارات",
    "اللوازم والكتب المدرسية والنقليات",
    "التعليم العام وشؤون الطلبة",
    "التعليم الخاص",
    "التعليم المهني والانتاج",
    "شؤون الموظفين",
    "الرقابة الداخلية",
    "الاشراف التربوي"
]


# قائمة المناطق
REGIONS = [
    "الهاشمية",
    "بيرين", 
    "الحلابات",
    "الظليل",
    "الازرق"
]


# قائمة أنواع الإجازات
LEAVE_TYPES = [
    "إجازة سنوية",
    "إجازة اعتيادية", 
    "إجازة مرضية",
    "إجازة طارئة",
    "إجازة أمومة",
    "إجازة حج",
    "إجازة عمرة",
    "إجازة دراسية",
    "إجازة بدون راتب",
    "مغادرة"
]